{
  "products": [
    {
      "id": "643haialj",
      "name": "Váy nữ xanh chấm bi",
      "categoryid": "ax2s6mh7k",
      "description": "Đầm xòe chấm bi vintage cổ sơ mi màu xanh nằm trong bộ sưu tập đầm xòe đẹp mới nhất của Damvaydep.net, thiết kế từ chất liệu voan châu tôn cao cấp cao cấp,...",
      "image": "https://firebasestorage.googleapis.com/v0/b/react-demo-c3ac9.appspot.com/o/images%2F10.jpeg?alt=media&token=a168f4d0-580c-415a-b697-1d3cdde35e67",
      "number": "5",
      "price": "25",
      "priceSale": "20"
    },
    {
      "id": "27kpse4za",
      "name": "Áo cộc tay Chanel",
      "categoryid": "ax2s6mh7k",
      "description": "ắt xắt ra miếng, nhưng nếu sắp đi du lịch, hoặc có tiệc tùng, thì bộ này rất đáng để đầu tư đó ạ. Nguyên set, giá hãng là 100 triệu, giá em ORDER chưa tới 1/10, nên quả thật, rất xứng đáng để chi luôn.\nĐây là một trong những mẫu nằm trong BST Cruise 2019 - lãnh địa vốn chỉ dành cho giới thương lưu, nên một khi đã chọn set đồ này, là mặc 1 bộ, đáng 1 bộ. Thời buổi công nghệ phát triển, lên hình ai cũng đẹp như ai, nhất thiết càng phải chú trọng đầu tư vào ăn mặc. Bởi nó chính là cách chỉn chu nhất, mạnh mẽ nhất giúp bạn tuyên ngôn với đám đông rằng bạn là ai, như thế nào...\nChất vải tweed đặc trưng của thương hiệu cao cấp, đi cùng với thiết kế phóng khoáng, sang trọng, hầu như không kén dáng.",
      "image": "https://firebasestorage.googleapis.com/v0/b/react-demo-c3ac9.appspot.com/o/images%2F4.jpeg?alt=media&token=66797b42-4c50-46e5-bcc9-dd760d031c51",
      "number": "2",
      "price": "18",
      "priceSale": "15"
    },
    {
      "id": "xkm7b61gn",
      "name": "Áo thun Gucci Disney 2020",
      "categoryid": "ax2s6mh7k",
      "description": "Chắc chắn là cái tên Gucci chẳng còn xa lạ với bạn và rất nhiều người.\n\nVới thiết kế độc đáo không thua kém bất kì một chiếc áo hàng hiệu nào. Mẫu Áo thun Gucci Disney 2020 đã và đang len lỏi vào cuộc sống, trở thành một phần không thể thiếu của văn hóa thời trang hiện đại.\n\nThiết kế chuẩn Form dáng thời trang hiện đại mà không đụng hàng – chiếc áo sẽ là người bạn thân thiết trong những đoạn đường đi chơi, đi học hay đi làm.\nÁo thun Gucci Disney 2020 là một phiên bản tạo nên sự khác biệt khi mà ngay khi ra mắt, nó đã được các tín đồ thời trang toàn cầu săn lùng và thi nhau đụng hàng.",
      "image": "https://firebasestorage.googleapis.com/v0/b/react-demo-c3ac9.appspot.com/o/images%2F35.jpeg?alt=media&token=cc8e0685-9fb4-4711-859f-46059553cb6a",
      "number": "20",
      "price": "15",
      "priceSale": "12"
    },
    {
      "id": "nhy1w730u",
      "name": "Áo Fendi Roma Cổ Tròn",
      "categoryid": "ax2s6mh7k",
      "description": "Những gì cậu đang thấy là một mẫu T-shirt của một hãng thời trang nổi tiếng. Cụ thể hơn nó là áo thun Fendi Roma đình đám, có kiểu dáng đơn giản, phong cách thể thao và được sản xuất bằng chất liệu cao cấp nên chắc chắn sẽ rất mát và dễ chịu.Nếu ai hỏi tớ là áo Fendi đắt tiền là do đâu thì tớ sẽ trả lời rằng: là do sự gia công tinh tế đến từng chi tiết. Chữ Fendi Roma được thêu một cách cẩn thận, chính xác làm nổi bât lên thương hiệu Fendi.",
      "image": "https://firebasestorage.googleapis.com/v0/b/react-demo-c3ac9.appspot.com/o/images%2F9.jpeg?alt=media&token=2f24cf2e-591e-428b-b651-1269cf518eee",
      "number": "1",
      "price": "13",
      "priceSale": "12"
    },
    {
      "id": "h89wjbkww",
      "name": "Chân Váy Chữ A Trắng ",
      "categoryid": "s678awytk",
      "description": "Chân Váy Chữ A Trắng Hàn Quốc có quần lót an toàn bên trong. Váy này không có lưng thun và có khóa kéo ở eo. Chất liệu:Cotton + polyester fiber. Size chân váy chữ A kẻ eo cao Hàn Quốc:\nS: Chiều dài váy: 39cm, chu vi vòng eo: 64cm, chu vi hông: 84cm.\nM: Chiều dài váy: 39cm, chu vi vòng eo: 68cm, chu vi hông: 86cm.\nL: Chiều dài váy: 40cm, chu vi vòng eo: 72cm, chu vi hông: 88cm.",
      "image": "https://firebasestorage.googleapis.com/v0/b/react-demo-c3ac9.appspot.com/o/images%2F32.jpeg?alt=media&token=eb303103-677a-499a-aca4-9ebdf44fd686",
      "number": "3",
      "price": "23",
      "priceSale": "20"
    },
    {
      "id": "ddmo3907u",
      "name": "ÁO CỘC TAY CHANEL Vàng",
      "categoryid": "ax2s6mh7k",
      "description": "Đắt xắt ra miếng, nhưng nếu sắp đi du lịch, hoặc có tiệc tùng, thì bộ này rất đáng để đầu tư đó ạ. Nguyên set, giá hãng là 100 triệu, giá em ORDER chưa tới 1/10, nên quả thật, rất xứng đáng để chi luôn. Đây là một trong những mẫu nằm trong BST Cruise 2019 - lãnh địa vốn chỉ dành cho giới thương lưu, nên một khi đã chọn set đồ này, là mặc 1 bộ, đáng 1 bộ. Thời buổi công nghệ phát triển, lên hình ai cũng đẹp như ai, nhất thiết càng phải chú trọng đầu tư vào ăn mặc. Bởi nó chính là cách chỉn chu nhất, mạnh mẽ nhất giúp bạn tuyên ngôn với đám đông rằng bạn là ai, như thế nào... Chất vải tweed đặc trưng của thương hiệu cao cấp, đi cùng với thiết kế phóng khoáng, sang trọng, hầu như không kén dáng.",
      "image": "https://firebasestorage.googleapis.com/v0/b/react-demo-c3ac9.appspot.com/o/images%2F16.jpeg?alt=media&token=f41011e6-a5d1-42e5-a0d6-73d4f20e28ec",
      "number": "3",
      "price": "15",
      "priceSale": "12"
    },
    {
      "id": "b5jftwowl",
      "name": "Váy nữ thời trang1234",
      "categoryid": "s678awytk",
      "description": "Thiết kế năng động, cá tính giúp bạn trở nên nổi bật trước đám đông. Đặc biệt chiếc váy được làm từ chất liệu vải cao cấp tạo nên cho bạn cảm giác mềm mại dễ chịu khi mặc, với màu sắc này sẽ làm cho bạn trở nên vừa năng động lại vừa quyến rũ.",
      "image": "https://firebasestorage.googleapis.com/v0/b/react-demo-c3ac9.appspot.com/o/images%2F20.jpeg?alt=media&token=138d62bf-f10d-4f27-8a54-3f5505e3f61a",
      "number": "6",
      "price": "16",
      "priceSale": "15"
    }
  ],
  "category": [
    {
      "id": "ax2s6mh7k",
      "danhmuc": "Danh muc 1",
      "mota": "Ao thun"
    },
    {
      "id": "s678awytk",
      "danhmuc": "Danh muc 2",
      "mota": "Ao khong co"
    }
  ]
}